Repository: itsthenavid/NavidRahimzadeh
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fa

source: Accounts
fa: حساب‌ها

source: Avatar
fa: آواتار

source: Nickname
fa: لقب

source: Biography
fa: بیوگرافی

source: Premium
fa: ویژه

source: The Display Name
fa: نام نمایشی

source: Date Joined
fa: تاریخ عضویت

source: Blog
fa: بلاگ

source: Category Name
fa: نام دسته‌بندی

source: You can choose a name for this category. This name is displayed when a post is read.
fa: می‌تونی یه اسم برای این دسته‌بندی انتخاب کنی. اسم این دسته‌بندی هنگام خوندن پست توسط کاربر نشون داده می‌شه.

source: Category Content
fa: محتوای دسته‌بندی

source: The description of this category can have a great impact on the process of editing, deleting, adding and naming it.
fa: توضیحاتِ این دسته‌بندی می‌تونه تاثیر مثبتی روی پروسه ویرایش، حذف، اضافه و نام‌گذاریِ این دسته‌بندی داشته باشه.

source: Active
fa: فعال

source: The "Active" option can stop posts from being shown to the public.
fa: خاموش کردن گزینه‌ی «فعال» می‌تونه نمایش پست رو متوقف کنه.

source: Category
fa: دسته‌بندی

source: Categories
fa: دسته‌بندی‌ها

source: Draft
fa: پیش‌نویس

source: Published
fa: منتشر شده

source: Post Banner
fa: بنر پست

source: The post banner is a field that is shown to the user next to the post title in any case and is completely different from other photos of the post content.
fa: بنر پست، فیلدی هست که در هر حالت کنار عنوان پست به کاربر نشون داده می‌شه و با عکس های دیگرِ محتوای پست، کاملاً متفاوت هستش.

source: Title
fa: عنوان پست

source: The title of the post does not need additional explanation, just remind me that it should be short and concise.
fa: عنوان پست نیاز به توضیح اضافی نداره، صرفا یادآور بشم که باید کوتاه و رِسا باشه.

source: Post Description
fa: توضیحات پست

source: The description of this post is shown for SEO and as a summary of this post and its content in the list of posts. The quality of literature and writing in this field is very important.
fa: توضیحات این پست برای SEO و به‌عنوان خلاصه‌ای از این پست و محتواش توی لیست پست‌ها نشون داده می‌شه. کیفیت ادبیات و نوشتار این فیلد خیلی مهمه.

source: Slug
fa: اسلاگ

source: Slugs are fields for addressing and are very important in SEO as well as site performance. Preferably, Slug should be English and meaningful.
fa: Slug ها فیلد هایی برای آدرس‌یابی هستند و در SEO و همچنین کارایی سایت اهمیت بالایی دارن. ترجیحاً Slug باید انگلیسی باشه و معنی‌دار هم باشه.

source: Post Category
fa: دسته بندی پست

source: Choose a category related to the content of the post for the post.
fa: یه دسته‌بندیِ مربوط به محتوای پست برای پست انتخاب کن.

source: Datetime Created
fa: تاریخ و زمان ایجاد

source: Datetime Modified
fa: تاریخ عضویت

source: Author
fa: نویسنده

source: Post Content
fa: محتوای پست

source: This part of the post is the body and full content of the post. Here you are not limited by any special rules and you can type as much as you want. Remember, your only limitation is offensive words. It is not acceptable to post offensive words on the site. Apart from this, in addition to the text, you can upload any file you want.
fa: این قسمت از پست، بدنه و محتوای کامل پست هستش. اینجا محدود به هیچ قاعده‌ی خاصی نیستی و می‌تونی به اندازه‌ای که دلت می‌خواد تایپ کنی. یادت باشه تنها محدودیت تو، کلمات توهین‌آمیز هستش. به هیچ‌وجه قرار گرفتن کلمات توهین‌آمیز توی سایت قابل‌قبول نیست. غیر از این موضوع، علاوه بر متن، می‌تونی هر فایلی که دلت خواست رو آپلود کنی.

source: Publish Datetime
fa: تاریخ و زمان انتشار

source: Tags
fa: تگ‌ها

source: Status
fa: وضعیت

source: Post
fa: پست

source: Posts
fa: پست‌ها

source: Publish Date
fa: تاریخ نتشار

source: Commenter
fa: نویسنده‌ی نظر

source: Comment
fa: نظر

source: Reply
fa: پاسخ

source: Comments
fa: نظرات

source: Post Detail
fa: جزئیات پست

source: Write...
fa: بنویسید...

source: You can comment on this post :) But first you have to <a href="/accounts/login/">login from this link</a> and if you don't have an account, <a href="/accounts/signup/">register from this link</a>.
fa: می‌تونی برای این پستمون نظر بذاری اما قبلش باید <a href='/accounts/login'>از این لینک وارد</a> بشی یا <a href='/accounts/signup/'>از این لینک ثبت‌نام کنی</a>.

source: Reply...
fa: سوالی، جوابی...

source: You can reply on this comment :) But first you have to <a href="/accounts/login/">login from this link</a> and if you don't have an account, <a href="/accounts/signup/">register from this link</a>.
fa: می‌تونی به این نظر جواب بدی اما قبلش باید <a href='/accounts/login'>از این لینک وارد</a> بشی یا <a href='/accounts/signup/'>از این لینک ثبت‌نام کنی</a>.

source: Post List
fa: پست‌ها

source: Pages
fa: صفحات

source: About Me
fa: درباره من

source: Hello my good friend, welcome to my website :) I am Navid Rahimzadeh, an Iranian Kurdish programmer/developer, musician and essayist. My main field of activity is in Multi-Platform programming with Dart / Flutter and web programming with Python / Django / DRF.
fa: سلام دوست خوب من، به وبسایت من خوش اومدی :) من نوید رحیم‌زاده، برنامه‌نویس / توسعه‌دهنده، نوازنده و مقاله‌نویس ایرانی کُرد هستم. حوزه اصلی فعالیت من برنامه‌نویسی Multi-Platform با Dart / Flutter و برنامه‌نویسی وب با Python / Django / DRF است.

source: In addition to the main part of my activity, the rest of my world of knowledge is related to tools such as Linux (distributions based on: Debian - Arch and RedHat) - Docker - Git - Github / GitLab - Testing (unit testing for Django) - JavaScript - Vue.js - SCSS - In relational databases (SQL): MySQL / MriaDB - PostgreSQL - OracleDB - In NoSQL databases: Redis - MongoDB - Monolithic architectures such as MVC / MTV and Micro-Service architecture are awarded. I am also familiar with PHP, C-Sharp and Laravel, Dot.NET frameworks.
fa: علاوه بر بخش اصلی فعالیت‌ام، باقی‌مانده‌ی دنیای دانش من به ابزار هایی مانند Linux (توزیع‌های مبتنی بر: Debian - Arch و RedHat) - Docker - Git - Github / GitLab - Testing (یونیت تست برای Django) - JavaScript - Vue.js - SCSS - در پایگاه‌داده‌های رابطه‌ای (SQL): MySQL / MriaDB - PostgreSQL - OracleDB - در پایگاه‌داده‌های غیررابطه‌ای: Redis - MongoDB - معماری‌های Monolithic مانند MVC / MTV و معماری Micro-Service تعلق می‌گیرد. همچنین با زبان‌های PHP، C-Sharp و چارچوب های Laravel، Dot.NET آشنایی دارم.

source: Also, in music, I have a strong interest in traditional Iranian music, and because of this interest, I have mastered the instruments of fiddle, tonbak, santoor, and def. Iranian traditional music is a part of our identity as Iranians, unfortunately this art is not as interesting as it used to be, but I personally try to play a part in preserving this ancient art.
fa: همچنین در زمینه موسیقی علاقه شدیدی به موسیقی سنتی ایرانی دارم و به واسطه این علاقه، به ساز های کمانچه، تنبک، سنتور و دف تسلط دارم. موسیقی سنتی ایرانی عضوی از هویت ما ایرانی هاست که متاسفانه به اندازه قبل جالب توجه جامعه نیست، اما من به شخصه تلاش می‌کنم سهمی در حفظ این هنر باستانی داشته باشم.

source: Writing is considered a positive point from any point of view; It can be for venting emotions, sharing knowledge, developing ideas and planning. Hence, essay writing is very important to me because it is a big part of writing, a lot of it is about sharing my knowledge and information :)
fa: نویسندگی از هر دیدگاهی نکته‌ مثبتی محسوب می‌شه؛ می‌تونه برای تخلیه احساسات باشد، اشتراک دانش، توسعه تفکرات و برنامه‌ریزی. از این رو، مقاله‌نویسی برای من بسیار مهم است چون عضو بزرگی از نویسندگی است، حجم زیادی از این اهمیت مربوط به اشتراک‌گذاری دانش و اطلاعات خودم هستش :)

source: What Do I Do?
fa: من چه کار هایی انجام می‌دم؟

source: Front-End and UI Design
fa: توسعه فرانت‌اند و طراحی UI

source: UI design and Front-End development with HTML, CSS and JavaScript. Although front-end development is not my area of ​​expertise, I have sufficient mastery of this field.
fa: طراحی UI و توسعه Front-End وب با HTML, CSS و JavaScript. گرچه توسعه Front-End شامل دامنه تخصص های من نمی‌شود، اما تسلط کافی نسبت به این حوزه را دارم.

source: Web Development and API
fa: توسعه وب و API

source: Web Back-End / API development, with Django / Django ReST Framework. Although I have sufficient knowledge of Ruby / Ruby On Rails :)
fa: توسعه Back-End وب / API، با Django / Django ReST Framework. گرچه به تسلط هم Ruby / Ruby On Rails دارم :)

source: Multi-Platform Software Development
fa: توسعه نرم‌افزار های چند پلتفرمی

source: Software UI development independent of the operating system with Dart and Flutter (executable in iOS, Android, Windows, Linux and Web)
fa: توسعه UI نرم‌افزار های مستقل از سیستم‌عامل با Dart و Flutter. (قابل اجرا در iOS، Android، Windows، Linux و Web.)

source: Photography
fa: عکاسی

source: Photography and recording beautiful views has always been one of the most pleasant arts. Despite my interest in art, recording and preserving beautiful moments has always been a fascinating and favorite thing for me.
fa: عکاسی و ثبت لحاظات زیبا همیشه از دل‌نشین‌ترین هنر ها بوده هست. علی‌رغم علاقه من به هنر، ثبت و نگهداری لحظاتِ زیبا همیشه برایم کار جذاب و مورد علاقه‌ای بوده است.

source: Navid Rahimzadeh
fa: نوید رحیم‌زاده

source: Home
fa: خونه

source: Portfolios
fa: نمونه‌کار ها

source: Contact With Me
fa: ارتباط با من

source: Developer, Musician and Essayist
fa: توسعه‌دهنده، نوازنده و مقاله‌نویس

source: Email
fa: ایمیل

source: Phone Number
fa: شماره تلفن

source: Activity Duration
fa: مدت‌زمان فعالیت

source: 6 Years
fa: ۶ سال

source: Location
fa: موقعیت مکانی

source: Iran, Kurdistan, Saqqez
fa: ایران، کردستان، سقز
